Show / Hide Table of Contents
Class ConcreteBlock
Data of concrete block
Inheritance
System.Object
ConcreteBlock
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteBlock
Properties
Improve this Doc   View Source
Height
Height of ConcreteBlock
Declaration
public double Height { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Lenght
Lenght of ConcreteBlock
Declaration
public double Lenght { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Material
Material of ConcreteBlock
Declaration
public string Material { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Width
Width of ConcreteBlock
Declaration
public double Width { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source